[
  {
    "puzzle_id": "121",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 159,
    "solution_page": 161,
    "final_contract": "6♦",
    "declarer": "West",
    "opening_lead": "♠2, South plays the Q spade.",
    "all_hands_east": "♠64 ♥A10863 ♦K753 ♣AJ",
    "all_hands_south": "♠Q73 ♥Q7 ♦Q ♣1087653 2",
    "all_hands_north": "♠K952 ♥9542 ♦J106 ♣94",
    "all_hands_west": "♠AJ108 ♥KJ ♦A9842 ♣KQ",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Planning and Execution",
    "key_insight": "Plan your play even when you think that the effort will be wasted",
    "solution_line": "Everything will be easy if trumps break 2-2, so plan the play based on the assumption that trumps are 3-1. After the spade lead you have to find four hearts with three diamonds - only then you will be able to discard three spades. If North holds three diamonds, hearts have to break 4-2 with the queen of hearts doubleton with South. For this reason finish drawing trumps in the dummy and finesse a heart. If three diamonds are with South – then hearts have to break 4-2 with precisely Q-9 with North. There will be no problems with communication. The above analysis shows that you have to play the ace of diamonds on the second trick and then a diamond to the king.",
    "result_comparison": "Closed room – Contract 3NT: +460 for EW. You played precisely: +10 IMP. Otherwise: -11 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "122",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 159,
    "solution_page": 162,
    "final_contract": "6♠",
    "declarer": "West",
    "opening_lead": "♥Q, South opened 3♥",
    "all_hands_east": "♠754 ♥J1093 ♦K4 ♣AJ43",
    "all_hands_south": "♠J8 ♥AK87652 ♦1087 ♣9",
    "all_hands_north": "♠K1093 ♥Q4 ♦93 ♣108652",
    "all_hands_west": "♠AQ62 ♥ ♦AQJ652 ♣KQ7",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Endplay",
    "key_insight": "A rather complicated endplay",
    "solution_line": "Order of play: 1. Ruff the heart lead. 2-4. Play the ace of diamonds and a small diamond to the king, both opponents following suit). Lead the ♥10 and ruff South's king. 5-8. Draw the last trump, discarding a spade from dummy. Play the king of clubs, a club to the jack (does South follow the suit?) and establish a heart trick with a ruffing finesse. If South did not follow the suit in the second round of clubs, then: 9-10. Overtake the queen of clubs with the ace and cash a heart, throwing a spade. Then throw North in with a club, throwing another spade. If South does not follow to the second club, the subsequent play depends on the number of trumps he reveals. If South has 3 diamonds then his distribution is as follows 2-7-3-1. Here is the final position: North has to keep three clubs (if he discards one club then go back to the endplay line). He will therefore have to discard two spades. You concede a spade and your hand is good. If South hand was 3-7- 2-1, then in the same ending play the queen of clubs and ace and another spade hoping for the king with North or that he will forget to unblock the jack.",
    "result_comparison": "Englishmen stopped in 3NT, +630 for EW. You played as above: +12 IMP. You failed to see the winning line: -12 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "123",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 159,
    "solution_page": 164,
    "final_contract": "4♥",
    "declarer": "West",
    "opening_lead": "♥A and another heart. Trumps break 2-2",
    "all_hands_east": "♠9 ♥1092 ♦A975 ♣AJ765",
    "all_hands_south": "♠K763 ♥65 ♦J83 ♣K1094",
    "all_hands_north": "♠A1052 ♥A4 ♦Q10642 ♣Q8",
    "all_hands_west": "♠QJ84 ♥KQJ873 ♦K ♣32",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Suit Analysis",
    "key_insight": "Analyse the opponents' actions",
    "solution_line": "The rare lead of the ace of trumps indicates a difficult choice of opening lead. It precludes North holding the ace and king of spades or the king and queen of clubs. There is still another chance left, to play for a 3-3 club break. Concede a club in the third trick (without cashing the king of diamonds). Why? The opponents may force you with a spade in the dummy and the ace of diamonds will be needed as an entry to established two club tricks. Is this the end of analysis? Are you happy with 36% for a 3-3 club break, plus a doubleton king-queen of clubs – all in all, less than 40%? If so, you have not appreciated the power of the spade suit. There is another line to follow: Order of play: 3-4. Cash the king of diamonds and enter the dummy with the ace of clubs. 5-6. Pitch a club on the ace of diamonds and play ♠ 9 ducking in your hand. If North takes the trick with ♠ 10, play for a double ruffing finesse in spades.",
    "result_comparison": "Closed room – your team mates sacrificed in spades against a heart game. Result: down three +800 for EW. You played trying to establish spade tricks: +620 = -5 IMP. You tried clubs: -14 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "124",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 159,
    "solution_page": 166,
    "final_contract": "7♠",
    "declarer": "West",
    "opening_lead": "♣J",
    "all_hands_east": "♠Q109 ♥K54 ♦Q2 ♣AKQ65",
    "all_hands_south": "♠632 ♥10832 ♦J10753 ♣9",
    "all_hands_north": "♠8 ♥Q76 ♦K984 ♣J10873",
    "all_hands_west": "♠AKJ754 ♥AJ9 ♦A6 ♣42",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♠",
    "main_technique": "Two Suit Squeeze",
    "key_insight": "The opponents' discards may put you on a right track.",
    "solution_line": "Draw trumps in three rounds and see how the clubs behave – unfortunately 5-1. Cross to your hand with a club ruff and play your penultimate trump, discarding a heart from the dummy. a) North's sensible discards in this case (when he is 1-3-4-5) will be two diamonds and a heart. This suggests that North is trying to protect his king of diamonds. Therefore, we cash the ace of diamonds and the last spade catches North in a triple squeeze. The defender can keep only one heart, which guarantees taking three heart tricks. b) If instead North discards three diamonds, this will strongly suggest 1-2-5-5 distribution. You will reach this final position: North has to discard a diamond on the last spade and you also discard a diamond, as does South. Why a diamond and not a club? If North has 1-1-6-5 shape, then he will be squeezed in diamonds and clubs on the second heart trick. The ace of hearts, a heart to the king and the queen of clubs perform the diamond-heart squeeze on South.",
    "result_comparison": "Closed room, contract 6♠, +1010 for the English. You have made it: +1510 = +11 IMP. You went down: -14 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "125",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 159,
    "solution_page": 168,
    "final_contract": "4♥",
    "declarer": "West",
    "opening_lead": "♠K, ♠Q and ♣9",
    "all_hands_east": "♠103 ♥K73 ♦A432 ♣KQ106",
    "all_hands_south": "♠A842 ♥J62 ♦J7 ♣8732",
    "all_hands_north": "♠KQJ96 ♥Q5 ♦K865 ♣94",
    "all_hands_west": "♠75 ♥A10984 ♦Q109 ♣AJ5",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Communication and Timing",
    "key_insight": "Keep looking for a chance until the end; You have to find North with 5-2-4-2 or 6-2-3-2 shape, with a doubleton heart honour and the king of diamonds.",
    "solution_line": "Order of play: 3-6. Win with the club ace and play a small club to the king (preserving communication in this suit). Continue with the king of hearts and a heart to the 10. Why not playing a club for the third round? Because with a 3-3 club break you cannot make it. North would give you a ruff-and-discard and, after ruffing in dummy and pitching a diamond from your hand, there would be no communication with your hand to draw the last trump.",
    "result_comparison": "The English beat the contract 4♠ doubled down three: +500 for EW. You found this complicated line of play: +620 = +3 IMP. If not: -12 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "126",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 160,
    "solution_page": 169,
    "final_contract": "6NT",
    "declarer": "West",
    "opening_lead": "♦10",
    "all_hands_east": "♠A3 ♥QJ7642 ♦AQ4 ♣J2",
    "all_hands_south": "♠7 ♥K1085 ♦765 ♣K8754",
    "all_hands_north": "♠J1095 ♥9 ♦10982 ♣10963",
    "all_hands_west": "♠KQ8642 ♥A3 ♦KJ3 ♣AQ",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♣",
    "main_technique": "",
    "key_insight": "Combine all your chances",
    "solution_line": "Win with the jack of diamonds in your hand and play the king and ace of spades. a) If you found North with four spades: finesse a heart, play a heart to the ace. if hearts break 3-2 there is no problem; if they are 4-1, concede a trump trick and play for the club finesse. b) If you found four spades with South: play the ace of heart and a heart – if North holds four hearts he cannot rise with the king. Cross to your hand with the king of diamonds, concede a spade and a successful club finesse will complete your day's work.",
    "result_comparison": "Closed room, Contract 6♠ +1430 for EW. You played 6NT accurately: no swing. You went down: -17 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "127",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 160,
    "solution_page": 170,
    "final_contract": "6♥",
    "declarer": "West",
    "opening_lead": "♣J. North discarded ♠5 on the first heart",
    "all_hands_east": "♠K10976 ♥AK3 ♦43 ♣AK8",
    "all_hands_south": "♠J842 ♥J106 ♦97 ♣Q632",
    "all_hands_north": "♠AQ53 ♥- ♦Q10652 ♣J1094",
    "all_hands_west": "♠- ♥Q987542 ♦AKJ8 ♣75",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♦",
    "main_technique": "Safety Play",
    "key_insight": "Make a safety play and play accurately",
    "solution_line": "Order of play: 1-2. Win the king of clubs and play the ace of hearts – North discards♠5. 3-4. Play a diamond to the king and a club to the ace. 5-6. A diamond to the ace and a diamond ruff with the king of hearts. 7-8. Ruff a spade and ruff a diamond.",
    "result_comparison": "The English made 6♥. You have also made it: no swing. You went down: -14 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "128",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 160,
    "solution_page": 171,
    "final_contract": "6♥",
    "declarer": "West",
    "opening_lead": "♣K. You opened 1♥ doubled by North",
    "all_hands_east": "♠7642 ♥AK865 ♦A52 ♣A",
    "all_hands_south": "♠83 ♥72 ♦1096 ♣J76432",
    "all_hands_north": "♠J1095 ♥3 ♦KQ84 ♣KQ95",
    "all_hands_west": "♠AKQ ♥QJ1094 ♦J73 ♣108",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Squeeze Play",
    "key_insight": "Do not give up; draw conclusions from the bidding",
    "solution_line": "Order of play: North made a light take-out double, which clearly indicates four spades. A count discard from South should confirm it. Draw trumps, ruff a club and cash your remaining spade winners. When you run your trumps, North will have to keep his last spade and the bare king-queen of diamonds, throwing his remaining clubs. You can then duck a diamond to establish the jack of diamonds. This is a typical squeeze without the count. You concede a trick after the squeeze has taken place.",
    "result_comparison": "The English made 6♥ after ♠K opening lead (ducked). A spade–diamond squeeze was then easy to set up. You managed to execute the necessary squeeze – no swing. If not: -14 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "129",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 160,
    "solution_page": 172,
    "final_contract": "7♠",
    "declarer": "West",
    "opening_lead": "♠9",
    "all_hands_east": "♠K3 ♥J94 ♦A8742 ♣Q43",
    "all_hands_south": "♠75 ♥Q107652 ♦KJ9 ♣J9",
    "all_hands_north": "♠92 ♥K83 ♦Q1063 ♣10876",
    "all_hands_west": "♠AQJ10864 ♥A ♦5 ♣AK52",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Complex Squeeze",
    "key_insight": "Work hard, even if you are not sure whether it will produce any profits",
    "solution_line": "Order of play: 1-3. Win a spade in your hand, play the ace of diamonds and ruff a diamond. 4-5. Cross to the dummy with the king of spades and ruff a diamond. This isolates the diamond guard with North. 6-8. Draw the remaining three trumps and the squeeze is set up without you being aware of it. Discard a heart, a club and a diamond from the dummy. You win in the following cases: a) clubs break 3-3; b) four clubs are with the king and queen of hearts; c) four clubs are with four diamonds.",
    "result_comparison": "The English feel at home with the slam zone, contract 7♠: +2210 for EW. You ruffed diamonds to set up the squeeze: no swing. You misplayed the hand: -20 IMP.",
    "additional_notes": ""
  },
  {
    "puzzle_id": "130",
    "book_title": "Dynamic Declarer Play - Virtual European Championship",
    "author": "K. Martens",
    "problem_page": 160,
    "solution_page": 174,
    "final_contract": "6♣",
    "declarer": "West",
    "opening_lead": "♠J",
    "all_hands_east": "♠3 ♥A10985 ♦653 ♣A1093",
    "all_hands_south": "♠K8652 ♥6 ♦Q942 ♣QJ5",
    "all_hands_north": "♠J10974 ♥QJ73 ♦1087 ♣8",
    "all_hands_west": "♠AQ ♥K42 ♦AKJ ♣K7642",
    "visible_in_problem": [
      "west",
      "east"
    ],
    "difficulty": "♥",
    "main_technique": "Complex Analysis",
    "key_insight": "Combine all your chances",
    "solution_line": "Order of play: 2-3. Play the king of clubs and a club to the ace. The clubs break 3-1. a) North has three clubs: 4-5. Play a heart to the king and a heart to the ace. Check whether queen and jack of hearts fall. 6-9. Finesse the jack of diamonds, cash your spade and diamond winners. 10. Throw North in with a club, hoping he will have to give a ruff-and-discard. b) South has three clubs: You have a problem with checking whether queen and jack of hearts are bare. Hearts may break 4-1. 4-6. Finesse the diamond, play ace of spades and king of diamonds (South may play the queen). 7-8. Now cash the ace of hearts and a heart to the king, South cannot ruff. 9-10. Time for the ace of diamonds and a club. Yes!",
    "result_comparison": "Closed room – Contract 4♥, +450 for EW. You played the slam accurately: +11 IMP. Not really: -11 IMP.",
    "additional_notes": ""
  }
]